/*

Андрій вирішив випити кави в одній Київській кав'ярні. Проте він згадав, що у Києві "червона зона".

Нагадаємо, що у "червоній зоні" у Києві лише повністю вакциновані люди (тобто ті, які отримали два щеплення) можуть відвідувати кав'ярні. Якщо ж людина неповнолітня (строго менше ніж 18 років), то вона може відвідати кав'ярню лише з повністю вакцинованим дорослим, при цьому дитина не зобов'язана бути вакцинованою.

Андрію n років та він отримав m щеплень. А його повнолітній батько, Борис, отримав уже k щеплень.

Визначте, чи зможе Андрій потрапити у кав'ярню. Можливо, разом з батьком.

Input
Перший рядок містить одне ціле число n (12≤n≤30) — вік Андрія.

Другий рядок містить два цілі числа m та k (0≤m,k≤2) — кількість щеплень, які отримали Андрій та Борис відповідно.

Output
Виведіть «Yes», якщо Андрій зможе потрапити у кав'ярню, або «No» — інакше.

Ви можете виводити букви у будь-якому регістрі.

Examples

Input #1
15
1 2

Answer #1
Yes

Input #2
29
1 2

Answer #2
No

*/

#include <assert.h>
#include <string.h>

const char *
solve(int n, int m, int k)
{
	if ((m >= 2 && n >= 18) || (n < 18 && k >= 2))
		return "Yes";
	return "No";
}

int
main()
{
	assert(!strcmp(solve(15, 1, 2), "Yes"));
	assert(!strcmp(solve(29, 1, 2), "No"));

	return 0;
}
