// Написати програму, яка виводить на консоль наступне повідомлення:
//
//   *
//  ***
// *****
//   *
//   *
//   *
//   *
//   #
//
// Input
// Вхідні дані відсутні.
//
// Output
// Виведіть вказане повідомлення у стандартний вихідний потік.
//
// Examples
// Input #0
// Answer #0
//   *
//  ***
// *****
//   *
//   *
//   *
//   *
//   #

const std = @import("std");

pub fn main() void {
    solve();
}

pub fn solve() void {
    const arrow: []const u8 =
        \\  *
        \\ ***
        \\*****
        \\  *
        \\  *
        \\  *
        \\  *
        \\  #
    ;

    std.debug.print("{s}\n", .{arrow});
}
