/*

На прохання учасників марафону BSM-2023 'Важлива задача - 5!' повертається!Написати програму виводу на консоль повідомлення відповідно до формату вихідних даних.

Input
Пропали…)))), бо Волан-де-Морт кинув авакидавру у вхідні дані, а Белла їх захопила…

Output
У стандартний вихідний потік виведіть текст: Hello, World!

Input #0

Answer #0
        *
        **
        ***
************
        ***
        **
        *

*/

package main

import "fmt"

func main() {
	fmt.Println(ARROW)
}

const ARROW = `
        *
        **
        ***
************
        ***
        **
        *
`
