// Задано натуральне тризначне число n (100≤n≤999). Утворіть чотиризначне число, у якому кількість тисяч дорівнює кількості одиниць заданого тризначного числа.
//
// Input
// Єдиний рядок вхідного стандартного потоку містить тризначне число n.
//
// Output
// У єдиний рядок вихідного стандартного потоку виведіть новоутворене число.
//
// Examples
//
// Input #0
// 147
//
// Answer #0
// 7147

const std = @import("std");

pub fn solve(n: usize) usize {
    return (n % 10) * 1000 + n;
}

pub fn main() void {
    std.debug.assert(solve(147) == 7147);
}
